{
  "home": "Početna",
  "about": "Vještine",
  "work": "Projekti",
  "contact": "Kontakt",
  "intro": "Pozdrav, ja sam",
  "intro-desc": " Frontend Developerka iz Belog Manastira, Hrvatska. Nedavno sam završila svoje obrazovanje kao Frontend developerka i imam veliku želju da učim, radim i napredujem u svom radu.",
  "intro-second-desc": " Tijekom svog obrazovanja otkrila sam istinsku strast prema web razvoju, što ćete pronaći kao odraz u ovom portfoliu. Trenutačno tražim poziciju junior dev kako bih započela svoju karijeru i učila među profesionalcima.",
  "skills": "moje vještine",
  "projects-title": "Moji nedavni projekti",
  "projects-desc": "Ove aplikacije predstavljaju različite primjere projekata koje sam radila pomoću Reacta i TypeScripta, kao i integriranje vanjskih API-ja za komunikaciju s drugim uslugama. Svaka od ovih aplikacija imaju svoj jedinstveni fokus i funkcionalnosti, ali svi oni dijele zajedničke karakteristike kao što su čista korisnička sučelja, responzivan dizajn te brz i učinkovit rad.",
  "projects-desc-2": "Za detaljan uvid u svaki projekt, možete istražiti",
  "projects-link": "Projekti",
  "projects-desc-3": "odjeljak, gdje ćete pronaći detaljnije opise aplikacija.",
  "projects-music": "App za pretragu glazbe",
  "projects-music-desc": "Pronađite svoju omiljenu pjesmu i uživajte...",
  "projects-todo": "To-do lista",
  "projects-todo-desc": "Kreirajte i pratite svoje zadatke...",
  "projects-chat": "Chat aplikacija",
  "projects-chat-desc": "Pošaljite poruku...",
  "projects-europe": "Europa",
  "projects-europe-desc": "Informacije o zemljama Europe...",
  "footer-link1": "Ilustracije od",
  "footer-link2": "iz",
  "skills-title": "Ključni aspekti mog web putovanja:",
  "skills-1": "Osnovni trio: HTML, CSS i JavaScript",
  "skills-1-desc": "Moje putovanje započelo je s osnovnim triom web razvoja — HTML , CSS i JavaScript. Ovi jezici čine temelj modernog web razvoja, omogućavajući mi kreiranje statičkih web stranica i dodavanje interaktivnosti.",
  "skills-2": "Ubrzani CSS rad s Sass-om",
  "skills-2-desc": "Da bih pojednostavila i ubrzala svoj rad, koristim Sass — moćni CSS preprocesor. S Sass-om mogu efikasno upravljati varijablama i funkcijama, omogućavajući mi pisanje jednostavnih i održivih stilova. Također koristim metodologiju BEM (Block Element Modifier) za strukturiranje CSS-a.",
  "skills-3": "Responzivan i adaptivan dizajn s pristupom prvo mobitelima",
  "skills-3-desc": "Primjenjujem principe responsivnog i adaptivnog dizajna, osiguravajući da moje web stranice jednako rade na raznim uređajima i veličinama ekrana. Prihvaćajući pristup prvo mobitelima, prioritetno dizajniram za manje ekrane, a zatim postupno unapređujem izgled za veće ekrane.",
  "skills-4": "Povećana pouzdanost koda s TypeScript-om",
  "skills-4-desc": "Da bih povećala pouzdanost i održivost svog koda, prihvatila sam TypeScript, nadskup JavaScript-a. Statičko tipiziranje TypeScript-a pomaže u ranom otkrivanju grešaka u razvojnom procesu, čineći temelj koda snažnijim i lakšim za upravljanje.",
  "skills-5": "Razvoj s React-om",
  "skills-5-desc": "U React-u sam uspješno kreirala funkcionalne komponente i stekla razumijevanje stanja i svojstava komponenti, što mi omogućava izgradnju dinamičnih i interaktivnih korisničkih sučelja. Uživam radeći s React-ovom komponentno-orijentiranom arhitekturom, jer omogućava modularni i ponovljivi kod.",
  "skills-6": "Želja za napretkom i učenjem",
  "skills-6-desc": "Iako neprestano razvijam svoje vještine, svakom izazovu pristupam s entuzijazmom i voljom za učenjem. Moja posvećenost kontinuiranom unapređenju gura me naprijed, i uzbuđena sam zbog mogućnosti koje leže predamnom u dinamičnom svijetu web razvoja.",
  "skills-7": "Budući izazovi",
  "skills-7-desc": "Uvijek sam voljna učiti i pristupam izazovima s entuzijazmom. Dok učim, s veseljem se nadam doprinosu značajnim projektima u dinamičnom svijetu web razvoja.",
  "project-1": "Aplikacija za pretragu glazbe",
  "project-1-desc": "Ovo je aplikacija za pretragu glazbe razvijena koristeći React, TypeScript i vanjske API-je. Omogućuje korisnicima pretragu omiljenih pjesama i pregled audio isječaka. Aplikacija koristi iTunes API kako bi dohvaćala rezultate pretrage na temelju unosa korisnika.",
  "project-2": "Chat aplikacija",
  "project-2-desc": "Ovo je aplikacija za chat izgrađena koristeći React i Scaledrone za WebSocket komunikaciju. Omogućuje korisnicima da se pridruže chat sobi i razmjenjuju poruke s drugim korisnicima u stvarnom vremenu. Svaki korisnik je predstavljen nasumično generiranim korisničkim imenom i jedinstvenom bojom.",
  "project-3": "To-do lista",
  "project-3-desc": "Ovo je jednostavna aplikacija za popis zadataka razvijena koristeći React. Omogućuje korisnicima da stvaraju, upravljaju i prate svoje zadatke ili stavke za obavljanje. Aplikacija pruža jednostavno sučelje za dodavanje novih zadataka, označavanje zadataka kao dovršenih i brisanje zadataka kada ih dovršimo.",
  "project-4": "Europa",
  "project-4-desc": "Aplikacija Europe koristi Fetch API za dohvaćanje podataka iz RestCountries API-ja, koji pruža detaljne informacije o zemljama Europe. Aplikacija koristi React-ove hooks za upravljanje stanjem i efektima kako bi omogućila realno vrijeme ažuriranja korisničkog sučelja.",
  "project-button": "Pogledajte projekt",
  "contact-section": "Kontakt",
  "contact-title": "Radimo zajedno !",
  "contact-desc": " Javite se, voljela bih čuti više o vama, vašem projektu i kako vam mogu pomoći!",
  "contact-mail": "Pošaljite mi email",
  "contact-location": "Hrvatska"
}
