{
  "home": "Home",
  "about": "Skills",
  "work": "Work",
  "contact": "Contact",
  "intro": "Hi, I'm",
  "intro-desc": " A passionate Front-end Developer based in Beli Manastir, Croatia. Recently, I completed my education as a Frontend developer and I have a deep desire to excel and improve in my work.",
  "intro-second-desc": "  During my education, I discovered my true passion for web development, which you will find reflected in this portfolio. Currently, I'm seeking a junior dev position to kick start my career and learn among professionals.",
  "skills": "my skills",
  "projects-title": "My recent projects",
  "projects-desc": "  These applications represent diverse examples of projects I have developed using React and TypeScript, as well as integrating external APIs for communication with other services. Each of these applications has its unique focus and functionalities, but they all share common characteristics such as clean user interfaces, responsive design, and fast and efficient performance.",
  "projects-desc-2": "For detailed insights into each project, you can explore the",
  "projects-link": "Work",
  "projects-desc-3": "  section, where you will find comprehensive descriptions and showcases of the applications.",
  "projects-music": "Music search App",
  "projects-music-desc": "Find your favorite song and enjoy...",
  "projects-todo": "To-do App",
  "projects-todo-desc": " Create, manage, and track your task...",
  "projects-chat": "Chat App",
  "projects-chat-desc": "Join a chat room...",
  "projects-europe": "Europe",
  "projects-europe-desc": "Information about countries worldwide...",
  "footer-link1": "Illustration by",
  "footer-link2": "from",
  "skills-title": "Key aspects of my web development journey:",
  "skills-1": "Foundational Trio: HTML, CSS, and JavaScript",
  "skills-1-desc": "My journey began with the foundational trio of web development—HTML , CSS , and JavaScript. These languages form the backbone of modern web development, allowing me to create static web pages and add interactivity.",
  "skills-2": "Streamlined CSS Workflow with Sass",
  "skills-2-desc": "To simplify and streamline my CSS workflow, I employ Sass — a powerful CSS preprocessor. With Sass, I can efficiently manage variables and functions, enabling me to write clean and maintainable stylesheets. I also using BEM (Block Element Modifier) methodology for structuring CSS.",
  "skills-3": "Responsive & Adaptive Design with Mobile-First Approach",
  "skills-3-desc": "I am a strong advocate of responsive and adaptive design principles, ensuring that my websites work seamlessly on various devices and screen sizes. Embracing a mobile-first approach, I prioritize designing for smaller screens, then gradually enhance the layout for larger screens.",
  "skills-4": "Enhanced Code Reliability with TypeScript",
  "skills-4-desc": "To enhance the reliability and maintainability of my code, I embraced TypeScript, a superset of JavaScript. TypeScript's static typing helps catch errors early in the development process, making the codebase more robust and easier to manage.",
  "skills-5": "React Development",
  "skills-5-desc": "In React, I have successfully created functional components and gained understanding of component states and props, enabling me to build dynamic and interactive user interfaces. I enjoy working with React's component-based architecture, as it allows for modular and reusable code.",
  "skills-6": "Embracing a Growth Mindset",
  "skills-6-desc": "Though I am continuously developing my skills, I approach every challenge with enthusiasm and a willingness to learn. My dedication to continuous improvement drives me forward, and I am excited about the possibilities that lie ahead in the dynamic world of web development.",
  "skills-7": "Looking Ahead",
  "skills-7-desc": "I'm always eager to learn and approach challenges with enthusiasm. As I continue to grow, I look forward to contributing to meaningful projects in the dynamic world of web development. ",
  "project-1": "Music search App",
  "project-1-desc": "This application is a music search app developed using React, TypeScript, and external APIs. It provides users with a seamless interface to search for their favorite songs and preview audio clips. The app leverages the iTunes API to fetch search results based on user input.",
  "project-2": "Chat Application",
  "project-2-desc": "This application is a real-time chat app built using React and Scaledrone for WebSocket communication. It allows users to join a chat room and exchange messages with other users in real-time. Each user is represented by a randomly generated username and a unique color .",
  "project-3": "To do list",
  "project-3-desc": "This application is a simple To-Do List app developed using React. It allows users to create, manage, and track their tasks or to-do items. The app provides a clean and user-friendly interface for adding new tasks, marking tasks as completed, and deleting tasks as they are completed.",
  "project-4": "Europe",
  "project-4-desc": "The Europe uses the Fetch API to retrieve data from the RestCountries API, which provides detailed information about countries worldwide. The application leverages React's state and effect hooks to manage the data and provide real-time updates to the user interface.",
  "project-button": "view project",
  "contact-section": "Contact",
  "contact-title": "Let's work together!",
  "contact-desc": " Please reach out, I would love to hear more about you, your project and how can I help!",
  "contact-mail": "Send me an email",
  "contact-location": "Croatia"
}
